In [12]:
import numpy as np
import pandas as pd

In [13]:
# Загрузка файла с данными
ttnc_data = pd.read_csv("data/titanic.csv")
ttnc_data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [14]:
ttnc_data.shape

(891, 15)

In [15]:
ttnc_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [23]:
# Удаление пустых значений 
df1 = pd.DataFrame({
    "c0": {"r0":100, "r1":200, "r2":300},
    "c1": {"r1":400, "r2":500, "r3":600},
    "c2": {"r0":np.nan, "r1":200, "r2":300}
})
df1

       c0     c1     c2
r0  100.0    NaN    NaN
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    NaN  600.0    NaN

In [28]:
# По умолчанию удаляются строки с Nan
df1.dropna()

       c0     c1     c2
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0

In [24]:
# Замена пустых значений на другие значения
df1.fillna(0)

       c0     c1     c2
r0  100.0    0.0    0.0
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    0.0  600.0    0.0

In [31]:
# Удаление строк по индексам
df1.drop("r0", axis=0)

       c0     c1     c2
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    NaN  600.0    NaN

In [30]:
# Удаление столбцов по индексам 
df1.drop("c1", axis=1)

       c0     c2
r0  100.0    NaN
r1  200.0  200.0
r2  300.0  300.0
r3    NaN    NaN

In [32]:
ttnc_data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [33]:
td_1 = ttnc_data.drop(["sibsp", "parch", "embarked", "deck"], axis=1)
td_1

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,7.2500,Third,man,True,Southampton,no,False
1,1,1,female,38.0,71.2833,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,7.9250,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,53.1000,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,8.0500,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,13.0000,Second,man,True,Southampton,no,True
887,1,1,female,19.0,30.0000,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,23.4500,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,30.0000,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,7.7500,Third,man,True,Queenstown,no,True

In [35]:
td_1 = td_1.fillna(0)
td_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   fare         891 non-null    float64
 5   class        891 non-null    object
 6   who          891 non-null    object
 7   adult_male   891 non-null    bool
 8   embark_town  891 non-null    object
 9   alive        891 non-null    object
 10  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(2), object(5)
memory usage: 64.5+ KB

In [55]:
# проверяем на дубликаты
td_1.duplicated(["survived", "pclass", "sex", "age", "embark_town", "fare", "alone"]).sum()

112

In [60]:
#удаляем дубликаты
td_1.drop_duplicated(["survived", "pclass", "sex", "age", "embark_town", "fare", "alone"]), inplace=True,
td_1.duplicated(["survived", "pclass", "sex", "age", "embark_town", "fare", "alone"]).sum()

SyntaxError: cannot assign to function call (Temp/ipykernel_10380/3881968784.py, line 2)

In [47]:
td_1.shape

(891, 11)

анализ данных

In [48]:
td_1.head(10)

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,7.2500,Third,man,True,Southampton,no,False
1,1,1,female,38.0,71.2833,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,7.9250,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,53.1000,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,8.0500,Third,man,True,Southampton,no,True
5,0,3,male,0.0,8.4583,Third,man,True,Queenstown,no,True
6,0,1,male,54.0,51.8625,First,man,True,Southampton,no,True
7,0,3,male,2.0,21.0750,Third,child,False,Southampton,no,False
8,1,3,female,27.0,11.1333,Third,woman,False,Southampton,yes,False
9,1,2,female,14.0,30.0708,Second,child,False,Cherbourg,yes,False

In [53]:
# Сколько выживших?
num_surv = td_1["survived"].sum()
num_surv

342

In [54]:
num_surv / td_1.shape[0] * 100

38.38383838383838

In [59]:
# минимальный, средний, максимальный возрасты
td_1["age"].min(), td_1["age"].mean(),td_1["age"].max()

(0.0, 23.79929292929293, 80.0)

In [61]:
# значение по столбцу survived при условии "age" == 80
# комбинация маскирования по строкам и индексацию по столбцам
mask = td_1["age"] == 80
td_1.loc[mask, "survived"]

630    1
Name: survived, dtype: int64

In [62]:
# комбинация маскирования по строкам и среза по столбцам
td_1.loc[mask, :]

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
630,1,1,male,80.0,30.0,First,man,True,Southampton,yes,True

In [69]:
# значение по столбцу survived при условии "age" == 0,42
# комбинация маскирования по строкам и индексацию по столбцам
mask = td_1["age"] == 0.42
td_1.loc[mask, :]

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
803,1,3,male,0.42,8.5167,Third,child,False,Cherbourg,yes,False

In [70]:
# уникальные значения по столбцу "embark_town"
td_1["embark_town"].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', 0], dtype=object)

In [71]:
# количество уникальных значений
td_1["embark_town"].nunique()

4

In [72]:
# прихотливая индексация (fancy)
arr_1 = np.arange(10, 20)
arr_1

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [73]:
arr_1[[0,3,1,0,5]]

array([10, 13, 11, 10, 15])

In [76]:
# значение по столбцу survived при условии "age" < 1
# комбинация маскирования по строкам и прихотливой индексации по столбцам
mask
td_1.loc[td_1["age"] < 1, ["survived", "embark_town", "sex"]]

     survived  embark_town     sex
5           0   Queenstown    male
17          1  Southampton    male
19          1    Cherbourg  female
26          0    Cherbourg    male
28          1   Queenstown  female
..        ...          ...     ...
859         0    Cherbourg    male
863         0  Southampton  female
868         0  Southampton    male
878         0  Southampton    male
888         0  Southampton  female

[184 rows x 3 columns]

In [77]:
num_surv / td_1.shape[0] * 100

38.38383838383838

In [83]:
td_2 = td_1.loc[td_1["age"] < 1, ["survived", "embark_town", "sex"]] 
td_2["survived"].sum() / td_2.shape[0] * 100

32.065217391304344

### GroupBy
Операции:
- разбиение
- применение 
- объединение

In [86]:
td_1.groupby("survived")[["age", "pclass"]].mean()

                age    pclass
survived
0         23.653005  2.531876
1         24.034123  1.950292

In [91]:
td_1.groupby("survived").aggregate({"age": np.mean, "pclass": pd.Series.max})

                age  pclass
survived
0         23.653005       3
1         24.034123       3

In [92]:
# группировка данных по нескольким категориям 
td_1.groupby(["survived", "who"])[["age", "pclass"]].mean()

                      age    pclass
survived who
0        child   7.220588  2.941176
         man    25.050111  2.454343
         woman  22.613636  2.848485
1        child   5.778980  2.408163
         man    27.875000  1.954545
         woman  26.748780  1.839024

In [94]:
td_1.groupby(["embark_town"])[["age", "pclass"]].mean()

                   age    pclass
embark_town
0            50.000000  1.000000
Cherbourg    23.844762  1.886905
Queenstown   10.214286  2.909091
Southampton  25.330357  2.350932